---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTriserRiserNumber
source: html/e9ef511e-293c-3d0c-b101-1867b32d8bc0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTriserRiserNumber Property

"Riser Number": Count the sequential number of riser in the stair.

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTriserRiserNumber { get; }
```